<?php
// Декодируем JSON-текст в ассоциативный массив PHP
//$data = json_decode($balance_json, true);

/////////////////////////////////////////////////////////////////////////////////////
// Удаляем токен "BCH" из массива "dep_tokens"
//$token_to_delete = 'BCH';
//$key = array_search($token_to_delete, $data['data']['dep_tokens']);
//if ($key !== false) {
//    unset($data['data']['dep_tokens'][$key]);
//}
/////////////////////////////////////////////////////////////////////////////////////
// Добавляем токен "XRP" в массив "dep_tokens"
//$data['data']['dep_tokens'][] = 'XRP';

/////////////////////////////////////////////////////////////////////////////////////

// Преобразуем ассоциативный массив PHP обратно в JSON-текст
//$json = json_encode($data);

//echo $json;
?>